# Задача 30:  Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# a1 = int(input("Введите первый элемент арифметической прогрессии: "))
# d = int(input("Введите разность арифметической прогрессии: "))
# n = int(input("Введите количество элементов арифметической прогрессии: "))

# progression = []
# for i in range(1, n + 1):
#     an = a1 + (i - 1) * d
#     progression.append(an)

# print("Арифметическая прогрессия: ", progression)

# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)


# array = [1, 4, 7, 9, 12, 15, 18, 25, 30]
# min_value = int(input("Введите минимальное значение диапазона: "))
# max_value = int(input("Введите максимальное значение диапазона: "))

# indexes = []
# for i in range(len(array)):
#     if min_value <= array[i] <= max_value:
#         indexes.append(i)

# print("Индексы элементов, принадлежащих заданному диапазону: ", indexes)

